{"0":{"index":0,"flower_name":"Aconite","flower_description":"Aconites are one of the first bulb flowers to bloom in the spring and are known for their cheerful yellow color. Plant Aconites in a large group together and you'll be able to smell their sweet, honey-like fragrance.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/winter-aconite-720790.jpg"},"1":{"index":1,"flower_name":"Ageratum","flower_description":"Also known as Flossflower, Ageratums come in blue, pink and white blooms. The taller varieties are best for cutting and displaying in your home, while the dwarf bedding varieties are best kept in the garden.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/ageratum-773201.jpg"},"2":{"index":2,"flower_name":"Allium","flower_description":"There are five varieties of the Allium, known primarily for their tall stems and large, spherical heads. Blooms are typically violet, but blue and pink varieties can also be found.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/purple-882161.jpg"},"3":{"index":3,"flower_name":"Anemone","flower_description":"The Anemone includes 120 species of flowers, but the most common types found in North America come in white, pink or violet hues. The Anemone is dainty and doesn't grow well during summer droughts, overly wet winters or high winds.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/summer-anemone-224501.jpg"},"4":{"index":4,"flower_name":"Angelica","flower_description":"Commonly found in tea and herbal remedies, the stem of the Angelica can even be made into candy. With over 50 species, the Angelica is also good for bees and other pollinators. Known for their large starburst flowers, it comes in white or green.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/angelica-400956.jpg"},"5":{"index":5,"flower_name":"Angelonia","flower_description":"Especially good for container gardening, the Angelonia will keep blooming all summer even if old flowers are removed. Once tall enough to cut, bring them inside and you'll notice a light scent that some say is reminiscent of apples.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/2826831993-e747eb6b05-b.jpg"},"6":{"index":6,"flower_name":"Artemisia","flower_description":"For those seeking a drought tolerant plant that doesn't make your yard look like a dessert, the Artemisia is for you. Tolerating low amounts of water, you can create a diverse xeriscape with this silvery flower.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/artemisia-vulgaris-848743.jpg"},"7":{"index":7,"flower_name":"Aster","flower_description":"Named after the Latin word for \"star,\" Asters will brighten up any garden. It attracts butterflies and comes in a variety of colors including blue, indigo, violet, white, red and pink. Unlike other colorful flowers, Asters will typically stay in bloom into cooler fall months.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/aster-tongolensis-57764.jpg"},"8":{"index":8,"flower_name":"Astilbe","flower_description":"Astilbes are deceptively delicate with their long, fern-like flowers. These flowers can actually withstand damp soil and shade, while still growing between one to six feet tall. Perfect to add for a pop of color to a garden that typically gets little sunlight.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/prachtspiere-167249.jpg"},"9":{"index":9,"flower_name":"Aubrieta","flower_description":"Named after Claude Aubriet, a French artist who famously painted them, Aubrietas spread low with small violet, pink or white flowers. If you're creating a rock garden, Aubrietas are ideal as it prefers sandy, well-drained soil.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/blue-pillow-52188.jpg"},"10":{"index":10,"flower_name":"Azalea","flower_description":"Often referred to as \"the royalty of the garden,\" these elegant flowers are known for their outstanding colors and foliage. With thousands of varieties to choose from, Azaleas require little maintenance once planted and can be brought inside to make a fabulous bouquet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-678629.jpg"},"11":{"index":11,"flower_name":"Balloon Flower","flower_description":"Balloon flowers start as hollow buds and, as it grows, eventually bursts open into a star-shaped flower. In addition to its beauty, Balloon flowers are resilient in the garden and can handle varying sunlight, water and soil.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/balloon-flower-829670.jpg"},"12":{"index":12,"flower_name":"Balsam","flower_description":"Bring the tropics to your garden with a Balsam plant. Easy to care for, it thrives in shadier spots, can tolerate heat and handle damp soil. Flowers come in almost every color of the rainbow, including red, orange, yellow, violet, white and pink.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/balsam-408530.jpg"},"13":{"index":13,"flower_name":"Baneberry","flower_description":"Perfect for cool, shaded spots, the Baneberry brings a holiday-inspired look to your garden. Before the Baneberry bears ornamental fruit, it features small white flowers. Beware though, the little red berries found on the plant are poisonous to eat!","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/actaea-spicata-baneberry.jpg"},"14":{"index":14,"flower_name":"Basket of Gold","flower_description":"With bright yellow, low-growing flowers, no wonder where the Basket of Gold got its name. Given its short height and golden color, this makes for a perfect addition to a rock garden or xeriscape.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flowers-882835-640.jpg"},"15":{"index":15,"flower_name":"Bee Balm","flower_description":"With the name Bee balm, this ornamental flower attracts not only bees, but hummingbirds and other beneficial pollinators. Bee balms are highly valued for their deep scarlet color, but also come in blue, violet, white and pink.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/bee-balm-1043110.jpg"},"16":{"index":16,"flower_name":"Begonia","flower_description":"Known for their attractive blooms, the Begonia is a timeless favorite among gardeners. Consisting of more than 1,700 specie, Begonias also make for good indoor plants if kept by a sunny window and watered regularly.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-788969.jpg"},"17":{"index":17,"flower_name":"Bellflower","flower_description":"With their happy, star-like flowers, the variety of Bellflowers available can fit any gardener's needs. Ranging from short to tall, and featuring almost every color of the rainbow, these cheery flowers are a great fit for your garden or cut to display in your home.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/bellflower-296124.jpg"},"18":{"index":18,"flower_name":"Bergenia","flower_description":"The Bergenia plant looks as sweet as its nicknames—also commonly known as Pigsqueak or Elephant's ears. While short in stature, the Bergenia makes up for it in ornate flowers and leaves that change from green to red or bronze in the cooler months.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/bergenia-407884.jpg"},"19":{"index":19,"flower_name":"Blackeyed Susan","flower_description":"Known as the official flower for the Preakness, Blackeyed Susans are a member of the sunflower family. In addition to making a beautiful indoor flower arrangement, Blackeyed Susans attract butterflies, bees and other beneficial insects.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/black-eyed-susan-334122.jpg"},"20":{"index":20,"flower_name":"Bleeding Heart","flower_description":"The Bleeding Heart's appearance is as equally dramatic as its name, bearing heart shaped flowers that hang from a long stem. It also makes for an exquisite cut flower to display in your home.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/plant-859459.jpg"},"21":{"index":21,"flower_name":"Bloodroot","flower_description":"This flower gets its name from the bright red poisonous sap if you cut into the stem, but on the outside the Bloodroot makes for a great addition to a shaded garden. In addition to a bright white flower, the leaves are scalloped to create an elegant package.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-554511.jpg"},"22":{"index":22,"flower_name":"Boneset","flower_description":"The Boneset is a wildflower that is easy to grow in most soil types, but watch out as it can pose a management problem and spread quickly. Well-suited for more natural looking gardens, the Boneset is also a friend among bees and butterflies.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/eupatorium-perfoliatum-sca-04381.jpg"},"23":{"index":23,"flower_name":"Browallia","flower_description":"The Browallia will grow in the darkest corners of your garden, preferring full shade and protection from the hot sun. It also makes for a great indoor plant during the summer as long as it's kept damp but not wet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/img-7246-browallia-speciosa.jpg"},"24":{"index":24,"flower_name":"Bugleweed","flower_description":"Bugleweed is a popular choice to fill a garden with low, colorful greenery, but be sure to maintain it as it can easily spread and take over your garden. Most prefer shade, but if your Bugleweed variety has purple leaves, it'll do well in heat.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/ajuga-reptans-846545.jpg"},"25":{"index":25,"flower_name":"Bugloss","flower_description":"Given it's tall height, attractive blooms and unalluring foliage, the Bugloss is often grown as accent border plants. This biennial is short lived and doesn't do well with excess moisture.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/blue-87504.jpg"},"26":{"index":26,"flower_name":"Buttercup","flower_description":"Who hasn't held a buttercup up to their chin to see it reflect its golden yellow shade? This cheerful plant is a favorite, but requires regular maintenance to keep it from spreading.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/buttercup-841225.jpg"},"27":{"index":27,"flower_name":"Butterfly Weed","flower_description":"The aptly named Butterfly Weed is a favorite among butterflies, but also bees and other beneficial insects. Propagation may take some time, but once the Butterfly Weed starts growing this hardy plant can endure full sun and a variety of soil types.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/butterfly-weed-50188.jpg"},"28":{"index":28,"flower_name":"Caladium","flower_description":"Caladiums are known for their heart or arrow shaped leaves and are a good addition to a garden needing some dramatic foliage. In addition to green, leaves are known to include hues of red, white, maroon, pink and cream.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/caladium-673899.jpg"},"29":{"index":29,"flower_name":"Calendula","flower_description":"Add a pop of color to your garden with the garden-friendly Calendula. This flower tolerates the cooler months and is even edible—it's spicy leaves are often found as a garnish in salads and soups.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/marigold-437818.jpg"},"30":{"index":30,"flower_name":"California Poppy","flower_description":"The California poppy is ideal for gardens in dry, sandy areas with full sun. Coming in a variety of colors including red, orange, yellow, white and pink, be sure to cut this wildflower to display inside.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/eschscholzia-californica-167272.jpg"},"31":{"index":31,"flower_name":"Canterbury Bells","flower_description":"Reminiscent of an old English cottage, Canterbury Bells represent gratitude and faith. Their charming violet bells make for a beautiful bouquet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/campanula-361364.jpg"},"32":{"index":32,"flower_name":"Cardinal Flower","flower_description":"Recognized for its deep scarlet red blooms, the Cardinal flower grows as high as 4 feet and attract beneficial insects like butterflies. While once in bloom the results are dazzling, this perennial's lifecycle is short lived.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/cardinal-flower-86592.jpg"},"33":{"index":33,"flower_name":"Carnation","flower_description":"The bright cluster of petals make the Carnation a playful choice for any garden or bouquet. Depending on the color you pick, a Carnation can be used as a symbol of friendship, love or fascination.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/carnation-833383.jpg"},"34":{"index":34,"flower_name":"Castor Bean","flower_description":"This massive plant—known to grow up to 10 feet tall—is a good addition if you're looking to add height or a backdrop for smaller plants. Watch out, the seeds, leaves and stem are poisonous!","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/red-castor-bean-leaf-941839.jpg"},"35":{"index":35,"flower_name":"Catmint","flower_description":"Cat owners rejoice! This popular feline plant's grey-green leaves and lavender flowers make a beautiful garden addition. It's also easy to care for, tolerating drier climates and full sun.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/8929943172-e96c6bcd6f.jpg"},"36":{"index":36,"flower_name":"Celosia","flower_description":"These ornamental plants get their name from the Greek word keleos, meaning \"burned.\" Their flame-like flower heads come in a variety of colors, including red, orange, yellow, violet, white and pink.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/celosia-731437.jpg"},"37":{"index":37,"flower_name":"Chives","flower_description":"While this herb may be best known sprinkled over potatoes, Chives' pink flowers also make for an attractive edging for flower gardens. Fairly tolerant of many soil types, Chives are easy to care for.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/chives-810932.jpg"},"38":{"index":38,"flower_name":"Chrysanthemum","flower_description":"The name Chrysanthemum comes from the Greek words for \"gold\" and \"flower,\" but come in a variety of colors besides yellow. With vibrant hues of white, yellow, red and pink, the Chrysanthemum features decorative pompom tops that can be beautifully displayed indoors.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/chrysanthemum-1051770.jpg"},"39":{"index":39,"flower_name":"Clary Sage","flower_description":"This annual comes in violet, white or pink and thrives in outdoor containers. As their bloom season comes to an end, you can either cut them to display proudly in your home or dry them as keepsakes.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/salvia-pratensis-839488.jpg"},"40":{"index":40,"flower_name":"Cleome","flower_description":"Also known as spider flower for its lacy foliage, the Cleome quickly fills any spare space in a garden. Deer resistant and drought tolerant, Cleomes also attract butterflies and hummingbirds.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/spider-flower-55027.jpg"},"41":{"index":41,"flower_name":"Coleus","flower_description":"This shade tolerant annual is known for its boldly patterned leaves and makes for a great border along gardens. Depending on the specie, the Coleus' leaves can come in shades of red, pink, orange, yellow, green, purple or white.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/nature-686480.jpg"},"42":{"index":42,"flower_name":"Columbine","flower_description":"Also known as Granny's Bonnet, the name Columbine comes from the Latin word \"dove\" because the shape of the inverted flower resembles doves clustered together. The Columbine is also a major source of food for a species of bumblebee call the Bombus hortorum.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/columbine-831740.jpg"},"43":{"index":43,"flower_name":"Comfrey","flower_description":"In addition to making a great garden, the Comfrey has topical medicinal and herbal uses. Comfreys like moist, somewhat shady locations and freely self-flowers, so it's more suited for ornamental plantings.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/rough-comfrey-115169.jpg"},"44":{"index":44,"flower_name":"Coneflower","flower_description":"A member of the daisy family, the Coneflower features rich hues of violet, white and pink. These easy to grow flowers are heat and drought tolerant, and make for a wild bouquet once cut.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/coneflowers-481005.jpg"},"45":{"index":45,"flower_name":"Coreopsis","flower_description":"Looking for a wildflower that's more manageable than the tall sunflowers? Look no further than the Coreopsis. With down by the prairie charm, the Coreopsis blooms brightly with shades of yellow, red and orange.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/coreopsis-70754.jpg"},"46":{"index":46,"flower_name":"Corydalis","flower_description":"From the Greek word \"crested lark,\" the Corydalis is not for the novice gardener. Hardy to very few zones (mostly zone 5), the Corydalis bloom season is short-lived with the right combination of sun, moisture and drainage.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/corydalis-ambigua.jpg"},"47":{"index":47,"flower_name":"Cosmos","flower_description":"Hailing from the sunflower family, the Cosmos are beautiful wildflowers that bloom in shades of red, orange, yellow, violet, pink and white. Growing up to 6 feet tall, this flower makes for an excellent addition to a bouquet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/cosmos-flower-433424.jpg"},"48":{"index":48,"flower_name":"Crocus","flower_description":"The cup-shaped Crocus blooms vary widely in color, often seen in shades of orange, yellow, violet or white. Their ease of care make for great outdoor containers, but they also excel indoors as a houseplant.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/spring-678225.jpg"},"49":{"index":49,"flower_name":"Crown Imperial","flower_description":"As majestic as its name, the Crown Imperial features one tall stem with a loop of tubular blooms. Blooms are commonly found in red, yellow or orange and will last longer if planted on its side so as to avoid rot.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/imperial-crown-52127.jpg"},"50":{"index":50,"flower_name":"Cushion Spurge","flower_description":"The drought tolerant Cushion Spurge actually get their bright yellow color not from the flower, but floral bracts found underneath. Foliage can also range in color, from green to purple to red.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/euphorbia-epithymoides-002.jpg"},"51":{"index":51,"flower_name":"Cyclamen","flower_description":"With its glossy, heart-shaped laves, the Cyclamen is a darling perennial. The Cyclamen is also a popular food source for a variety of insects and animals, from caterpillars to pigs.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/cyclamen-194431.jpg"},"52":{"index":52,"flower_name":"Daffodil","flower_description":"One of the most recognizable perennials, you know its spring time once a Daffodil is in bloom. Their iconic trumpet flowers typically come in yellow, but are also grown with red, orange, yellow, white and even pink blossoms.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-661585.jpg"},"53":{"index":53,"flower_name":"Dahlia","flower_description":"There are 42 species of Dahlia, but most popular versions are known for its bushy, tuberous flower. Dahlias can be difficult to grow, requiring well-drained soil and full sun, but the payoff is great with a colorful garden ranging in hues from red to violet to pink.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-197343.jpg"},"54":{"index":54,"flower_name":"Daisy","flower_description":"The iconic, playful daisy is most recognized for its bright yellow center and white petals. Daisies are easy to grow and not fussy when it comes to soil types, although it does thrive in full sun.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/daisies-276112.jpg"},"55":{"index":55,"flower_name":"Dame’s Rocket","flower_description":"Dame’s Rocket is an aggressive growing biennial and is known to attract moths. Commonly found in white or violet, Dame's Rocket spread particularly quickly in rich, wet soil.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/dames-rocket2.jpg"},"56":{"index":56,"flower_name":"Delphinium","flower_description":"Also commonly known as \"larkspur,\" the Delphinium is highly toxic to both humans and animals. While dangerous to eat, Delphinium's tall, bell-like blooms and tall stems make for beautiful additions to gardens or cut for bouquets.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/delphinium-456347.jpg"},"57":{"index":57,"flower_name":"Diascia","flower_description":"The low growing Diascia makes for a great filler in outdoor containers, hanging baskets, window boxes and indoor pots. They are also relatively easy to grow, requiring only full sun and cool weather.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/nature-679346.jpg"},"58":{"index":58,"flower_name":"Dusty Miller","flower_description":"This hardy drought and frost tolerant plant makes for an ideal filler for outdoor containers and gardens. Its silver-grey foliage provides a nice backdrop to any bolder colored blooms.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/plant-93460.jpg"},"59":{"index":59,"flower_name":"Dutchman's Breeches","flower_description":"These sweet flowers get their name from the up-side-down hanging blooms that resemble pants. Dutchman's Breeches are one of the few flowers whose seeds are spread by ants, so don't fret if you see a colony nearby!","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/dicentra-cucullaria.jpg"},"60":{"index":60,"flower_name":"Epimedium","flower_description":"With green foliage and pink, yellow or purple flowers, the Epimedium makes for good groundcover in shady, moist gardens. As the seasons progress, their green leaves can have tints of bronze, copper and red.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/elfenblume-epimedium-x-versicolor.jpg"},"61":{"index":61,"flower_name":"Evergreen Candytuft","flower_description":"Know for its small, cloud-like blooms, this sun-loving flower makes for a great addition to rock gardens. Often cascading over rocks or walls, the Evergreen Candytuft is ideal for a filler in containers or to act as a border.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/evergreen-candytuft-324393.jpg"},"62":{"index":62,"flower_name":"Fennel","flower_description":"When not harvested, this edible perennial herb can grow up to 6 feet tall and feature dark foliage. It also attracts beneficial insects, including swallowtail butterflies.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/fennel-223059.jpg"},"63":{"index":63,"flower_name":"Fountain Grass","flower_description":"This ornamental grass shows off flowy, plumed flowerheads and provide a unique contrast to any garden. They are most commonly found in white, but for more of a \"wow\" factor, look for shades of red, violet and pink.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/purple-fountain-grass-7797.jpg"},"64":{"index":64,"flower_name":"Foxglove","flower_description":"This elegant flower requires a bit of patience, as it typically takes two seasons before its iconic blooms appear. But the wait is worth the payoff and the hardy Foxglove can handle a wide range of sun and soil types.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/thimble-397911.jpg"},"65":{"index":65,"flower_name":"Gaillardia","flower_description":"Ideal for hot, dry landscapes, the Gaillardia adds some extra spice to any garden. In bright hues of red, orange, yellow and violet, the Gaillardia makes for a dramatic wildflower bouquet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/gaillardia-370546.jpg"},"66":{"index":66,"flower_name":"Gas Plant","flower_description":"Gas plants can take a few years to cultivate, but are easy to care for and, once flowering, give off an aromatic scent. Be careful though, the flowers and foliage are known to cause skin rashes for some.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/dictamnus-169656.jpg"},"67":{"index":67,"flower_name":"Gaura","flower_description":"The elegant Gaura features dainty white or pink blooms. Thriving in a variety of soil types, the Gaura is known to quickly take over gardens and be difficult to trim down—so don't let your garden go unmanaged for too long!","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/gaura-lindheimeri-cherry-brandy-2.jpg"},"68":{"index":68,"flower_name":"Gazania","flower_description":"Growing large, daisy-like flowers, the Gazania is commonly used as colorful groundcover in sun soaked gardens. It can also be brought inside during the fall as long as it's kept near bright light and few waterings.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/gazanie-499110.jpg"},"69":{"index":69,"flower_name":"Geranium","flower_description":"Geranium includes 422 species, known for its five colorful petals commonly found in white, pink, purple or blue. Geraniums are a favorite amongst gardeners given their ease of care and ability to thrive in outdoor containers.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/cranesbill-141576.jpg"},"70":{"index":70,"flower_name":"Geum","flower_description":"The fickle Geum prefers full sun, but doesn't thrive in extreme weather changes. Moderately difficult to cultivate, their tall, striking spring blooms last only a few months.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-743753.jpg"},"71":{"index":71,"flower_name":"Globe Thistle","flower_description":"The Globe Thistle, with its tall stem and spherical flowerhead, screams for attention. Coming in shades of blue and violet, the Globe Thistle attracts bees and butterflies, as well as making for a gorgeous cut bouquet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/globe-thistle-53355.jpg"},"72":{"index":72,"flower_name":"Glory of the Snow","flower_description":"Glory of the Snow is an early bloomer, making it a popular choice for gardeners looking for a low growing plant to carpet their landscaping. Be sure to maintain their growth, as once established they tend to quickly form large clumps.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/star-hyacinth-682369.jpg"},"73":{"index":73,"flower_name":"Goatsbeard","flower_description":"These feathery white or yellow blooms grow as tall at 6 feet, providing a striking backdrop to any garden. Goatsbeard performs best in partial shade and prefers a moist environment.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/forests-geibart-167247.jpg"},"74":{"index":74,"flower_name":"Golden Marguerite","flower_description":"The daisy-like Golden Marguerite is short lived, so take in its aromatic foliage and sweet flowers while its around. Towards the end of the season, you can collect them and use the flowers as a natural fabric dye to produce shades of yellow.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/golden-yellow-flowers-957729.jpg"},"75":{"index":75,"flower_name":"Gomphrena","flower_description":"The globe-like flowerheads of the Gomphrena brighten any garden. Hardy and easy to grow, the Gomphrena is a popular choice in dried flower bouquets and Hawaiian leis given it'll hold it's compact shape after being cut.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/globe-amaranth-969222.jpg"},"76":{"index":76,"flower_name":"Heliotrope","flower_description":"Derived from the Greek words for \"sun\" and \"turn,\" the Heliptrope actually performs best when planted in partial shade. Their tiny, delicate cluster of blue, violet or white blooms make for good outdoor containers and can even be brought indoors in a cool, sunny spot in your home.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/valerian-413021.jpg"},"77":{"index":77,"flower_name":"Hepatica","flower_description":"The small woodland Hepatica features blue, violet, pink or white blooms. Named after the Greek word for \"liver,\" Hepatica foliage is a clump of three-lobed leaves that resemble a human liver.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/hepatica-748456.jpg"},"78":{"index":78,"flower_name":"Hollyhock","flower_description":"Hollyhocks are known for their tall spikes of trumpet-like flowers, commonly found in bright red, yellow, violet, white or pink. Hollyhocks can grow as tall as 8 feet, so have some stakes handy to prop them up and encourage growth.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/stock-rose-380072.jpg"},"79":{"index":79,"flower_name":"Hosta","flower_description":"These shade tolerant plants are most popular for their large foliage shape and color. Acting as groundcover, Hosta foliage is commonly found in dark green and white, but can also feature blue and yellow.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/hosta-837182.jpg"},"80":{"index":80,"flower_name":"Hyacinth","flower_description":"This popular bulb plant produces bulbous-like flowers in vibrant shades of blue, indigo and violet. An easy to grow plant, Hyacinths can be grown for for a variety of uses, such as outdoor containers, rock gardens or indoors.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/hyacinth-21687.jpg"},"81":{"index":81,"flower_name":"Hyssop","flower_description":"The versatile Hyssop is grown in a variety of ways, including containers, around garden borders or clumped together. Hyssops can grow in poor soil and tolerate drought.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/hyssopus-officinalis-002.jpg"},"82":{"index":82,"flower_name":"Impatiens","flower_description":"Impatiens make for great container plants, either indoors or outdoors, given their ability to tolerate damp soil and shady areas. Their low, dark foliage will spout a range of colors, including red, orange, violet, white and pink.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/impatiens-666480.jpg"},"83":{"index":83,"flower_name":"Iris","flower_description":"Known for its ornate flowers, the Iris is from the Greek word for \"rainbow.\" The Greeks had it right, as this popular flower appears in every color spectrum. Made up of more than 250 species, the Iris ranges in height and bloom times.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/iris-639410.jpg"},"84":{"index":84,"flower_name":"Jack-in-the-Pulpit","flower_description":"Given its equally playful name, the Jack-in-the-Pulpit foliage grows unexpectedly, creating a hood-like shape once fully grown. Before the flower appears, it's often confused as poison ivy.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/jack-in-the-pulpit-907415.jpg"},"85":{"index":85,"flower_name":"Jacob’s Ladder","flower_description":"Jacob's Ladder doesn't get its name not from its blooms, rather the arrangement of the leaves going up the stem that resembles a ladder. The dainty, bell-like flowers of the Jacob's Ladder make for a beautiful garden favorite.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/vogelaeuglein-167240.jpg"},"86":{"index":86,"flower_name":"Lady's Mantle","flower_description":"With foliage loosely resembling cabbage, the Lady's Mantle is most well known as a medicinal herb. If you're looking to add some green to your bouquet, the Lady's Mantle looks elegant once cut.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/ladys-mantle-alchemilla-vulgaris-2816px.jpg"},"87":{"index":87,"flower_name":"Lantana","flower_description":"Also known as Yellow Sage, the Lantana blooms in combinations of red, orange, yellow, violet, white and pink. While popular for outdoor containers and houseplants, some have found the subtle citrus scent to be off putting.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/lantana-699796.jpg"},"88":{"index":88,"flower_name":"Lavender","flower_description":"Popular in gardening, fragrance and cooking, you can't go wrong with a Lavender plant. In addition to its versatility, Lavender is easy to grow, requiring very little water and full sun.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/lavender-810522.jpg"},"89":{"index":89,"flower_name":"Lavender Cotton","flower_description":"Despite its name, the flowers on Lavender Cotton have an unpleasant scent, but perfumeries will extract its oil to use in colognes and perfumes. For gardening, this shrubby evergreen tolerates many soil types and full sun.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/lavender-cotton-341934.jpg"},"90":{"index":90,"flower_name":"Leadwort","flower_description":"Starting in the late summer, but lasting until early fall, Leadwort features dainty, dark blue flowers. While you may have to wait a while to see blooms, Leadworts are fine when left with morning sun and afternoon shade.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flowers-195967.jpg"},"91":{"index":91,"flower_name":"Lemon Balm","flower_description":"Love the smell of citrus? The bright lemony scent of this plant is perfect for you. Easy to grow and quick to spread, Lemon Balm is ideal for filler and background in a garden or outdoor container.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/lemon-balm-787626.jpg"},"92":{"index":92,"flower_name":"Lily","flower_description":"With more than 100 species, the Lily is know for its large, prominent flowers and long filaments. These fragrant flowers come in a range of colors including white, yellow, orange, pink, red and purple and some include markings such as spots or brush strokes. These beauties shine indoors, just be sure to cut their filaments to avoid pollen stains!","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/lily.jpg"},"93":{"index":93,"flower_name":"Lobelia","flower_description":"Lobelia is an excellent choice for hanging gardens or window boxes given their ability to create a long trail. Lobelias love intense heat and will bloom delicate flowers in shades of red, blue, violet and white.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/lobelia-777674.jpg"},"94":{"index":94,"flower_name":"Lupine","flower_description":"Also known as blueonnets or quaker bonnets, the Lupine has grey-green leaves coated in silvery hairs. The blue or purple flowers grow along the tall stems, while the seeds are often harvested as a substitute for soybeans.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/beautiful-2223.jpg"},"95":{"index":95,"flower_name":"Maiden Pink","flower_description":"These sweet flowers produce fringed petals in bright shade or red, pink or white. Maiden Pink is hardy but also known to be an aggressive plant that self seeds, so its often used for groundcover or garden borders.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/maiden-pink-546015.jpg"},"96":{"index":96,"flower_name":"Malva","flower_description":"As the origin for the name of the color \"mauve,\" the Malva features pink and purple blooms with stripes that radiate outwards. Malva is a vigorous plant and often seen growing freely in fields and hedges.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-774761.jpg"},"97":{"index":97,"flower_name":"Marigold","flower_description":"Marigolds are an easy easy way to add rich color to your garden. Aromatic and inviting to butterflies and hummingbirds, the Marigold comes primarily in shades of red, orange and yellow. Bring inside and arrange to make a beautiful golden bouquet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-669579.jpg"},"98":{"index":98,"flower_name":"Mazus","flower_description":"Mazus is excellent for rock gardens or growing alongside stepping stones, as these small perennials grow to only two inches tall. Watch out though, Mazus will spread quickly if not kept in check.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/mazus-pumilus-flower.jpg"},"99":{"index":99,"flower_name":"Mirabilis","flower_description":"Also known as Four O'Clocks, the Mirabilis produces bright yellow, pink, purple, red and white flowers. Tolerating droughty soil, the Mirabilis is an easy to grow plant that will continue to bloom into mid-fall frost.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/mirabilis-jalapa-402433.jpg"},"100":{"index":100,"flower_name":"Moonflower","flower_description":"The Moonflower looks as sweet as it sounds. This vine only blooms at dusk and closes back up just after dawn. Attracting beneficial insects like hummingbirds and nocturnal moths, the Moonflower is the perfect addition to a garden trellis, gate or fence.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/ipomoea-alba.jpg"},"101":{"index":101,"flower_name":"Morning Glory","flower_description":"The Morning Glory is most well known for their unraveling bloom that occurs in the early morning and shrivel back up in the hot afternoon sun. Once in bloom, flowers come in shades of red, blue, violet, white and pink and also feature star markings.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/sky-blue-morning-glory-8793.jpg"},"102":{"index":102,"flower_name":"Nasturtium","flower_description":"Nasturtium's vibrant red, orange and yellow flowers not only add a pop of color to gardens and outdoor containers, their flowers also make for a zesty addition to salads. Nasturtiums are tough and thrive in droughty and low fertile soils, making it ideal for warmer climates.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/nasturtium-686987.jpg"},"103":{"index":103,"flower_name":"Nierembergia","flower_description":"Also known as Cupflower, the Nierembergia prefers rich, moist soil and comes in blue, violet and white shades. Growing into early fall, the Nierembergia can handle some frost and make for great late-season bouquets.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/nierembergia-frutescens.jpg"},"104":{"index":104,"flower_name":"Orchid","flower_description":"As one of the top two largest flower plant families, the Orchid consists of about 27,800 accepted species. The most common genus, Phalaenopsis, is what is typically seen in home gardens and containers. They come in a vareity of tropical colors, including violet, pink, orange, red and white.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/orchid-648410.jpg"},"105":{"index":105,"flower_name":"Osteospermum","flower_description":"Also known as the African Daisy, Osteospermums come in yellow, blue, violet, white and pink. While difficult at first to cultivate, Osteospermums tolerate a variety of soil conditions and can grow during frost into mid-fall.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/african-daisy-338121.jpg"},"106":{"index":106,"flower_name":"Pansy","flower_description":"These delightful, friendly flowers are early bloomers and often one of the first signs of springtime. With brightly lit faces in shades of red, orange, yellow, blue, violet, white and pink, Pansies will bloom in single, bicolors or tricolors.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/pansy-826463.jpg"},"107":{"index":107,"flower_name":"Pearly Everlasting","flower_description":"Pearly Everlasting blooms into mid-fall, making a perfect fit for the frost prone garden. Requiring damp soil, Pearly Everlasting is easy to grow but must be maintained to avoid overgrowth.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/14939471371-f714900331.jpg"},"108":{"index":108,"flower_name":"Perennial Flax","flower_description":"The Perennial Flax has a short lifespan and is moderately difficult to care for, requiring well-drained soil and full sun. Once in bloom though, it will self seed and grow to a large, cushion clump.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/linum-narbonense-flor.jpg"},"109":{"index":109,"flower_name":"Periwinkle","flower_description":"This long lasting plant (known to grow over three seasons) is simple to manage and produces vibrant flowers in violet, white or pink. Keep the bloom lasting into the winter by bringing it indoors and placing it in full sun.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/periwinkle-166913.jpg"},"110":{"index":110,"flower_name":"Petunia","flower_description":"Equally hardy as they are precious, Petunias are a popular choice among beginner gardeners given their ease of care and adaptability to harsh climates. With a long bloom season, Petunias are most commonly found in violet, white or pink colors.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/petunia-662536.jpg"},"111":{"index":111,"flower_name":"Pincushion Flower","flower_description":"The Pincushion Flower gets its name from the long, grey stamens that resemble pins growing out of the cushion of the flowers. Coming in red, yellow, blue, violet, white and pink, Pincushion Flowers attract bees and hummingbirds.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/field-scabious-167397.jpg"},"112":{"index":112,"flower_name":"Polka Dot Plant","flower_description":"This spotted plant is equally as popular as an indoor plant, preferring filtered sun, well-drained soil and frequent misting to retain moisture. Outside, the Polka Dot Plant grows with vivid white, red or pink spots on its dark green leaves.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/hypoestes-phyllostachya1.jpg"},"113":{"index":113,"flower_name":"Primrose","flower_description":"The cheery Primrose comes in many bright colors, including red, orange, yellow, blue, indigo, violet, white and pink. While popular for indoor containers, it isn't meant to be a long lasting houseplant, so be prepared for a short lifespan similar to Orchids or Poinsettias.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-737864.jpg"},"114":{"index":114,"flower_name":"Ranunculus","flower_description":"These lustrous flowers include more than 60 species, including the popular Buttercup. Other varieties come in red, white, purple, orange and pink colors, known for their bulbous, closely formed petals.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-663507.jpg"},"115":{"index":115,"flower_name":"Red Valerian","flower_description":"This low maintenance plant handles a variety of soil types and excels in full sun. Featuring dense, fragrant flowers, Red Valerian doesn't only come in red, but also blue, white and pink blooms.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/centranthus-ruber-884234.jpg"},"116":{"index":116,"flower_name":"Rock Soapwort","flower_description":"Used primarily as an ornamental plant in rock gardens, the Rock Soapwort features small blooms in shades of red and pink. Despite its tolerance of droughty and low fertile soil, it doesn't perform well in hot, humid weather.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/caryophillaceae-saponaria-ocymoides-2.jpg"},"117":{"index":117,"flower_name":"Rose","flower_description":"With more than 100 species, the Rose is most commonly categorized for its trailing stems with sharp prickles. Roses vary in size and shape, but are vibrant in colors ranging from red, yellow, orange, blue, white and pink. Given the many species, Roses also hybirdize easily, allowing you to explore the many varieties.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/rose-113735.jpg"},"118":{"index":118,"flower_name":"Rue","flower_description":"Rue is an evergreen plant often found as accent foliage or manicured into hedges. It tolerates just about any sun and soil type, but be aware that the leaves are toxic and can cause a skin rash if you make contact.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/meadow-rue-909022.jpg"},"119":{"index":119,"flower_name":"Sanvitalia","flower_description":"If you're a Sunflower fan seeking a shorter substitute, look no further. The small Sanvitalia resemble their taller cousins with dark brown centers and golden yellow petals. Add them to windowboxes or other outdoor containers where they can get a lot of sunlight.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flower-679333.jpg"},"120":{"index":120,"flower_name":"Scarlet Sage","flower_description":"Spotted easily with their flaming red flowers, newer Scarlet Sage plant hybrids can also come in pink, purple or white flowers. Easy to grow and generally low maintenance, it's a popular choice for public gardens and areas.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/fire-sage-228379.jpg"},"121":{"index":121,"flower_name":"Sea Lavender","flower_description":"Despite the name, Sea Lavender has no relation to the Lavender plant, but do have similar growing properties. Preferring full sun and can tolerate droughty soil, Sea Lavender comes in shades of blue, violet and pink.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/winged-beach-lilac-375590.jpg"},"122":{"index":122,"flower_name":"Sea Thrift","flower_description":"Small and clustered, the Sea Thrift comes in red, violet, white and pink colors. Preferring full sun and sandy soil, do not plant in wet or humid conditions so as to avoid plant rot.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flowers-14448.jpg"},"123":{"index":123,"flower_name":"Shirley Poppy","flower_description":"The ruffled, delicate flowers of the Shirley Poppy come in a range of red, orange, yellow, violet, white and pink hues. You can cut Shirley Poppies to bring inside, but they must be carefully prepped by sticking the cut stem in boiling water for 30 seconds in order to close the cut.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/poppies-381612.jpg"},"124":{"index":124,"flower_name":"Shooting Star","flower_description":"Resembling a star shooting through outer space, this dazzling wildflower prefers moist soil and partial to full shade. In addition to the popular white, Shooting Stars come in violet and pink shades too.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/372840525-f193108fe4.jpg"},"125":{"index":125,"flower_name":"Silvermound","flower_description":"Its name is not misleading, the Sivlermound's fine silver leaves and dense clump make for a showy addition to your garden. While small yellow flowers are known to bloom, they're often removed to keep its silvery-green foliage.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/artemisia-schmidtiana-parc-de-bercy.jpg"},"126":{"index":126,"flower_name":"Skunk Cabbage","flower_description":"If you guessed the Skunk Cabbage gives off a less than favorable scent, you guessed right! It blooms very early in the season—as early as late January—but should be grown further from the home if you're concerned about the smell.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/yellow-skunk-cabbage-605523.jpg"},"127":{"index":127,"flower_name":"Snapdragon","flower_description":"These easy to grow flowers are known for their mouth-like petals that can open and close by pressing gently between your fingers. Enjoy the Snapdragon while its around, as it has a short lifespan, but make for great bouquets and indoor arrangements.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/yellow-144061.jpg"},"128":{"index":128,"flower_name":"Snow in Summer","flower_description":"The Snow in Summer is exactly that—dotted star-like white flowers that bloom even in sandy, drought prone soils. Spread it along rock gardens and xeriscapes to add as a simple backdrop.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/cerastium-tomentosum-flower.jpg"},"129":{"index":129,"flower_name":"Snowdrop","flower_description":"Resembling little droplets of snow, this early flowering bulb features delicate, pure white blooms. It performs well in containers, indoors or outdoors, as long as its kept in cool and moist.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/snowdrop-523667.jpg"},"130":{"index":130,"flower_name":"Solomon's Seal","flower_description":"Coming from the Greek word for \"many knees,\" the multi-jointed Solomon's Seal is easy to care for. If you live in a cool, moist region, you can enjoy the rows of white bell flowers that hang from its stem.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/polygonatum-odoratum-338936.jpg"},"131":{"index":131,"flower_name":"Spring Snowflake","flower_description":"These small, bill-like flowers prefer rich, well-drained soil and partial shade. Growing upright with a dainty bloom, Spring Snowflakes work for outdoor containers as well as indoor houseplants.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/snowflake-5665.jpg"},"132":{"index":132,"flower_name":"Summer Savory","flower_description":"Similar in taste to oregano and used as a popular herb in French cuisine, the Summer Savory is also good for gardens for their ease of care and hardiness. When left to bloom, it'll feature small white, violet or pink flowers that can be cut and dried for display.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/summer-savory-115371.jpg"},"133":{"index":133,"flower_name":"Sunflower","flower_description":"Known for their tall stalks and bright yellow petals, the Sunflower is an all time classic wildflower. They most commonly come in yellow, but Sunflowers can also be found in rich orange and red hues.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/sunflower-290496.jpg"},"134":{"index":134,"flower_name":"Sweet Alyssum","flower_description":"The genus name for Sweet Alyssum comes from the Greek word \"small pod,\" referring to the shape of its fruits. Its flowers come in violet, white or pink hues and its creeping habit make it useful for filing gaps in pathways or stone walls.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/little-dorrit-322525.jpg"},"135":{"index":135,"flower_name":"Sweet Woodruff","flower_description":"The Sweet Woodruff gives of a slight fragrance that is less sweet and more fresh, similar to freshly cut grass. It spreads easily, but isn't as aggressive as other quick growing plants and other flowers can grow through its foliage.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/8743214671-165e278b8f.jpg"},"136":{"index":136,"flower_name":"Tansy","flower_description":"Also know as Golden Buttons, the Tansy features bright yellow, button-shaped flower heads that dot the tall, slender stems. Commonly found in cottage gardens and meadows, the Tansy is easy to care for and can spread if not maintained.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/tansy-10381.jpg"},"137":{"index":137,"flower_name":"Thunbergia","flower_description":"Similar in shape to a Blackeyed Susan, the Thunbergia comes in orange, yellow and white colors. They perform best when shaded from intense afternoon sun and can also make great indoor plants.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/black-eyed-susan-407767.jpg"},"138":{"index":138,"flower_name":"Tithonia","flower_description":"The tall, colorful Tithonia is similar to the Sunflower, but can thrive in poorer soil conditions and intense heat. Tithonias attract butterflies and hummingbirds, but will really shine once cut and displayed in a bouquet.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/tithonia-diversifolia-765106.jpg"},"139":{"index":139,"flower_name":"Torenia","flower_description":"Also called the Wishbone Flower, the Torenia gets its nickname from the two stamens that meet at the top to form a wishbone shape. Coming in yellow, violet, white and pink blooms, it also makes for a good houseplant.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/8225263728-e0f786f37d.jpg"},"140":{"index":140,"flower_name":"Trillium","flower_description":"Add this perennial to a woodland garden for a naturalized effect. With trumpet-like blooms and dark green foliage, the Trillium can be a challenge to cultivate and care for.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/trillium-179717.jpg"},"141":{"index":141,"flower_name":"Tulip","flower_description":"With about 75 species, the Tulip is known for its bright, bulbous flowers and elegant stems. Producing one flower per stem, Tulips come in a dazzling array of colors from reds to pinks to violets and make for gorgeous bouquets inside your home.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/tulip-271352.jpg"},"142":{"index":142,"flower_name":"Verbena","flower_description":"With easy maintenance and a selection of bright colors, the Verbena is a classic outdoor or hanging container plant. It attracts butterflies and hummingbirds, in addition to making for a beautiful cut arrangement to bring indoors.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/flowers-756181.jpg"},"143":{"index":143,"flower_name":"Violet","flower_description":"The Violet is an easy to maintain perennial with blooms ranging from pale violet to peach. Violets will blanket the ground with its foliage and often bloom once in the spring or summer, then re-bloom in early fall.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/plant-978227.jpg"},"144":{"index":144,"flower_name":"Virginia Bluebell","flower_description":"These dainty, horn-like flowers grow best in moist, partly shady gardens. The Virginia Bluebell mostly attracts butterflies, but you will get the occasional bumblebee if they can hover long enough to reach nectar.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/virginiabluebells.jpg"},"145":{"index":145,"flower_name":"Wild Senna","flower_description":"If your garden soil has clay, the Wild Senna is a perfect fit. Growing up to 4 feet tall, Wild Senna also attracts bees, butterflies and hummingbirds. Caterpillars are also known to make Wild Senna their home before they turn into butterflies!","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/senna-multiglandulosa-5.jpg"},"146":{"index":146,"flower_name":"Windflower","flower_description":"Similar in shape and size to the Anemone, Windflowers come in blue, indigo, violet, white and pink colors. It's daisy-like flowers bloom in early spring, a time when little else is in season.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/anemone-nemorosa-18303.jpg"},"147":{"index":147,"flower_name":"Yarrow","flower_description":"The finely-textured Yarrow comes in an array of colors including red, yellow, white and pink. It also has a pleasing scent that resembles chamomile and makes for beautiful dried flowers for display.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/yarrow-181683.jpg"},"148":{"index":148,"flower_name":"Yellow Archangel","flower_description":"The shade-loving Yellow Archangel can grow quickly and aggressively if left unmaintained. Also, be careful not to crush this plant while growing, as the leaves can give off a faint odor.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/dead-nettle-474348.jpg"},"149":{"index":149,"flower_name":"Yellow Loosestrife","flower_description":"The Yellow Loosestrife loves moisture and damp soil, but be careful not to let this plant go ignored. It's known to self seed and spread rapidly. When maintained, Yellow Loosestrife adds a bright pop of yellow and grows as tall stalks.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/loosestrife-8153.jpg"},"150":{"index":150,"flower_name":"Zinnia","flower_description":"The classic Zinnia is easy to grow and provides vibrant red, orange, yellow, violet white or pink blooms. Lasting from the summer into mid-fall, Zinnias attract butterflies and hummingbirds.","flower_picture":"https://www.proflowers.com/blog/wp-content/plugins/pf-flowertypes/image/zinnia-413564.jpg"}}